// Объявите две переменные: admin и name.
// Запишите строку "Джон" в переменную name.
// Скопируйте значение из переменной name в admin.
// Выведите на экран значение admin, используя функцию alert (должна показать «Джон»).

// задача 1 работа с переменными

let name = 'Джон';
let admin = name;


console.log(admin);

// задача 2 правильные имена
//  test
// Создайте переменную для названия нашей планеты. Как бы вы её назвали?
// Создайте переменную для хранения имени текущего посетителя сайта. Как бы вы назвали такую переменную?

let ourPlanet = 'Earth';

let currentVisitor;

//задача 3 заглавные или строчные для констант

const BIRTHDAY = '18.04.1982'; // верхний регистр для тех констант которые известны и меняться не могут

const age = someCode(BIRTHDAY); // для age ставится нижний регистр так как возраст меняется и вычисляется по требованию